Repository: HugoNikanor/calp
Catalog: po/*.po
Languages: sv

source: Output is by default supressed, since many fields contain way to much data to read. This turns it on again.
sv: Som standard är utskrifter avstängda, eftersom många fällt inehåller aldelles för mycket data för att läsas. Det här slår på det igen.

source: Print this help.
sv: Visar den här hjälpen.

source: Input file
sv: Indatafil

source: Output file
sv: Utdatafil

source: Start date of output.
sv: Startdatum för utdatan.

source: Writing to [~a]~%
sv: Skriver till [~a]~%

source: Unknown html style: ~a
sv: Okänd html-stil: ~a

source: all done
sv: Allt klart

source: Returns all elements between these two dates.
sv: Returnerar alla element mellan de två datumen.

source: Name of calendar to import into
sv: Namn på kalendar att importera till

source: ics file to import
sv: ics-fil att importera

source: No calendar named ~s~%
sv: Ingen kallender vid namn ~s~%

source: About to import the following ~a events into ~a~%
sv: På väg att importera ~a händelser till ~a~%

source: Continue? [Y/n]
sv: Fortsätt? [J/n]

source: Use IPv6.
sv: Använd IPv6.

source: Use IPv4.
sv: Använd IPv4.

source: Reload events on SIGUSR1
sv: Ladda om händelser vid SIGUSR1

source: Port to which the web server should bind.
sv: Port till vilken webservern ska binda.

source: Listening for SIGUSR1~%
sv: Vakar för SIGUSR1~%

source: Received SIGUSR1, reloading calendars~%
sv: Mottog SIGUSR1, laddar om kallendar~%

source: Starting server on ~a:~a~%I'm ~a, runing from ~a~%
sv: Startar server på ~a:~a~%Jag är ~a, körandes från ~a~%

source: Which date to start on.
sv: Vilket datum att börja på.

source: Width of written text, defaults to 70 chars.
sv: Brädd på den "tryckta" texten; 70 tecken som standard.

source: Prints this help.
sv: Visar den här hjälpen.

source: Input pdf file
sv: PDF-fil att arbeta på

source: Static data to fill fields with
sv: Statisk data att fylla fälten med

source: Search term for dynamic filling. Supports basic globbing
sv: Sökterm för dynamisk ifyllning. Stödjer grundläggande "globbar"

source: Template required
sv: Mall krävs

source: Needs list, not pair
sv: Behöver lista, inte par

source: Need more days
sv: Behöver fler dagar

source: Groups required in template
sv: Grupper krävs i mallen

source: Next-start needs to be a procedure
sv: Next-start måste vara en procedur

source: Prev-start needs to be a procedure
sv: Prev-start måste vara en procedur

source: Calendar for the dates between ~a and ~a
sv: Kallender för tidsintervallet ~a till ~a

source: Page generated
sv: Sidan genererad

source: Current time
sv: Nuvarande tid

source: Source Code
sv: Källkod

source: Week
sv: Veckovy

source: Month
sv: Månadsvy

source: Today
sv: Idag

source: Month overview
sv: Månaden i översikt

source: Search
sv: Sök

source: Option sliders
sv: Inställningsreglage

source: Event blankspace
sv: Händelsetomrum

source: Fontsize
sv: Typsnittsstorlek

source: Calendar list
sv: Kallenderlista

source: Earlier
sv: Tidigare

source: Search results
sv: Sökresultat

source: Show today
sv: Till idag

source: Search term
sv: Sökterm

source: limit to future occurences
sv: Begränsda till framtida instanser

source: Error searching
sv: Misslyckades söka

source: Result (page ~a)
sv: Resultat (sida ~a)

source: Only give one of onclick, href and submit.
sv: onlick, href, och submit är ömsesidigt uteslutande.

source: Places the generated thingy in debug mode
sv: Placerar den genererade mojängen i debug-läge

source: Makes the document editable
sv: Gör dokumentet redigerbart

source: Error calculating foreground color?~%~s~%
sv: Misslyckades beräkna förgrundsfärg?~%~s~%

source: View
sv: Visa

source: Location:
sv: Plats:

source: Last modified
sv: Senast ändrad

source: Recurrences
sv: Upprepningar

source: - Choose a Calendar -
sv: - Välj en kallender -

source: Summary
sv: Sammanfattning

source: Start time
sv: Starttid

source: End time
sv: Sluttid

source: Whole day?
sv: Heldag?

source: Recurring?
sv: Upprepande?

source: Location
sv: Plats

source: Description
sv: Beskrivning

source: Categories
sv: Kattegorier

source: Category
sv: Kattegori

source: Frequency
sv: Frekvens

source: Until
sv: Till och med

source: Conut
sv: Antal

source: Interval
sv: Intervall

source: By Second
sv: Per sekund

source: By Minute
sv: Per minut

source: By Hour
sv: Per timme

source: By Month Day
sv: Per månadsdag

source: By Year Day
sv: Per årsdag

source: By Week Number
sv: Per veckonummer

source: By Month
sv: Per månad

source: By Set Position
sv: Per fix-position

source: Weekstart
sv: Veckobörjan

source: Close
sv: Stäng

source: Fullscreen
sv: Fullskärm

source: Remove
sv: Ta bort

source: Overview
sv: Översikt

source: Edit
sv: Redigera

source: Changelog
sv: Händelseförlopp

source: Name
sv: Namn

source: Perm
sv: Mod

source: Scandir argument invalid or not directory: ~a
sv: Scandir:s argument ogilgit eller inte katalog: ~a

source: Go to Today
sv: Gå till idag

source: uid required
sv: uid krävs

source: Saving event to disk failed.
sv: Misslyckades spara händelse till disk.

source: No event with UID '~a'
sv: Ingen händelse med UID '~a'

source: Both 'cal' and 'data' required
sv: Både 'cal' och 'data' obligatoriska

source: No calendar with name [~a]
sv: Ingen kallender heter [~a]

source: XML parse error
sv: XML inläsningsfel

source: Object not a VEVENT
sv: Objektet är inte ett VEVENT

source: Unlinking old event from ~a~%
sv: Tar bort den gamla händelsen från ~a~%

source: Event updated ~a~%
sv: Händelse uppdaterad ~a~%

source: Event inserted ~a~%
sv: Händelse infogad ~a~%

source: No component with UID=~a found.
sv: Hittade ingen komponent med UID=~a.

source: Missing config protperty slot
sv: Skanat konfigurationsegenskapsfält

source: Pre crashed for
sv: Pre krashade för

source: Missing config
sv: Saknad konfiguration

source: Configuration variables
sv: Konfigurationsvariabler

source: Crash on warnings.
sv: Krasha på varningar

source: NO LOCATION
sv: INGEN PLATS

source: == Day View ==
sv: == Dagsvy ==

source: End
sv: Slut

source: quick search:
sv: Snabbsök:

source: search:
sv: sök:

source: == Search View ==
sv: == Sökvy ==

source: Starting REPL server at ~a~%
sv: Startar REPL-server på ~a~%

source: Failed to unlink ~a
sv: Misslyckades med att avlänka ~a

source: Empty address?
sv: Tom address?

source: How did you get here?
sv: Hur hamnade du här?

source: Path to alterantive configuration file to load instead of the default one.
sv: Sökväg till alternativ konfigurationsfil.

source: Display version, which is ~a btw.
sv: Visar version, vilket är ~a helt apropå.

source: Print this help
sv: Visar den här hjälpen.

source: Configuration file ~a missing
sv: Konfigurationsfilen ~a saknas

source: Failed loading config file ~a~%~s~%
sv: Misslyckades med att ladda konfigurationsfilen ~a~%~s~%

source: tzget not installed, please put it in one of ~a
sv: tzget är inte intstalleratt, vänligen placera programmet i en av ~a

source: Unsupported mode of operation: ~a~%
sv: Orimligt subbkomando: ~a~%

source: Default zoneinfo only available when tz-dir and tz-list are configured
sv: Standardzoninfo endast tillgängligt när tz-dir och tz-list är satta

source: what even is "Standard time"‽
sv: Vad är ens "Standardtid"‽

source: Invalid key ~a. Note that leap seconds and expries rules aren't yet implemented.
sv: Ogiltig nyckel ~a. Notera att skottsekunder och utgångsreglerännu inte är implementerade.

source: Unresolved link, target missing ~a -> ~a
sv: Ohanterad länk, saknar mål ~a -> ~a

source: Check your input
sv: Kontrollera din input

source: Counting backward for RRULES unsupported
sv: Att räkna baklänges stdöjs inte för RRULES

source: %z not yet implemented
sv: %z ännu ej implementerat

source: Invalid format char
sv: Ogiltigt formatteringstecken

source: Adding timespecs of differing types
sv: Lägger till tidsspecifikationer av olika typer

source: ~a on formatting description, ~s
sv: ~a vid formattering av beskrivning, ~s

source: Binary field not marked ENCODING=BASE64
sv: Binärdatefält ej markerat ENCODING=BASE64

source: ~a invalid boolean
sv: ~a är inte en giltig boolean

source: Non integer as integer
sv: Icke-heltag som heltal

source: Non-escapable character: ~a
sv: Tecken utan specialtolkning: ~a

source: No parser for type
sv: Ingen inläsare för typ

source: Unknown key ~a
sv: Okänd nyckel ~a

source: List in enum field
sv: Lista in uppräkningsinstansfält

source: List in non-list field: ~s
sv: Lista i fält för icke-lista: ~s

source: TODO Implement REQUEST-STATUS
sv: TODO implementera REQUEST-STATUS

source: WARNING parse error around ~a ~? line ~a ~a~%
sv: VARNING inläsningsfel runt ~a ~? rad ~a ~a~%

source: ERROR parse error around ~a ~? line ~a ~a Defaulting to string~%
sv: FEL inläsningsfel runt ~a ~? rad ~a ~a Faller tilbaka på sträng~%

source: PERIOD writer not yet implemented
sv: PERIOD-formaterrare ännu ej implementerad

source: No writer for type
sv: Ingen formatterare för typ

source: No events in component~%~a
sv: Inga händelser i komponenten~%~a

source: Invalid type ~a, with value ~a
sv: Ogiltig typ ~a, med värde ~a

source: Request status not yet implemented
sv: Statusbegäran ännu ej implementerad

source: Building <events> from~%
sv: Bygger <events> från~%

source: Reload done~%
sv: Omladdning färdig~%

source: Parsing ~a
sv: Läser ~a

source: Can't parse file of type
sv: Kan inte läsa fil av typen

source: Can't give week together with day or time
sv: Kan inte ge vecka tillsamans med dag eller tid

source: Last Modified
sv: Senast ändrad

source: Usage: <b>calp</b> [ <i>flags</i> ] <i>mode</i> [ <i>mode flags</i> ]
sv: Användning: <b>calp</b> [ <i>flaggor</i> ] <i>subkommando</i> [ <i>Subkommandosflaggor</i> ]

source: Modes
sv: Subkommandon

source: <p><b>html</b> reads calendar files from disk, and writes them to static HTML files.</p>
sv: <p><b>html</b> läser kalenderfiler från disk, och matar ur sig statiska HTML-filer.</p>

source: <p><b>terminal</b> loads the calendars, and starts an interactive terminal interface.</p>
sv: <p><b>terminal</b> laddar kalendrar, och startar ett en interaktiv miljö i terminalen.</p>

source: <p><b>ical</b> loads the calendar database, and immediately re-serializes it back into iCAL format. Useful for merging calendars.</p>
sv: <p><b>ical</b> laddar kallenderdatabasen, och återserialiserar den omedelbart tillbaka till iCAL. Användbart för att slå samman kallendrar.</p>

source: Flags
sv: Flaggor

source: loading...
sv: laddar...

source: List of default zoneinfo files to be parsed
sv: Lista av standardzoninfofiler att ladda

source: <p><b>server</b> starts an HTTP server which dynamically loads and displays events. The <i>/month/{date}.html</i> &amp; <i>/week/{date}.html</i> runs the same output code as <b>html</b>. While the <i>/calendar/{uid}.ics</i> uses the same code as <b>ical</b>.</p>
sv: <p><b>server</b> startar en HTTP-server vilken dynamiskt laddar och visar händelser. Addresserna <i>/month/{date}.html</i> &amp; <i>/week/{date}.html</i> kör samma utskriftskod som <b>html</b>. Emedans <i>/calendar/{uid}.ics</i> delar kod med <b>ical</b>.</p>

source: <group>Read from <i>file</i> instead of standard input.</group>
sv: <group>Läs fran <i>file</i> istället för standard-input.</group>

source: <group>Map between real field names and human readable names.<br/> If data is given, but not trans, then data is assumed to be in a correct format</group>
sv: <group>Översättningstabell mellan verkliga fältnamn och mänskligt läsbara namn.<br/>Om data är given, men inte översättingstabellen, så antas datan redan ha korrekta nycklar</group>

source: <group>Input format (otherwise infered from <i>infile</i>)</group>
sv: <group>Inputformat (härleds annars från <i>infile</i>)</group>

source: <group>Output format (otherwise infered from <i>outfile</i>)</group>
sv: <group>Utadataformat (härleds annars från <i>outfile</i>)</group>

source: <group>How many pages should be rendered. If --style=<b>week</b> and --from=<b>2020-04-27</b>; then --count=<b>4</b> would render the four pages 2020-04-27, 2020-05-04, 2020-05-11, and 2020-05-25. Defaults to 12 to give a whole year when --style=<b>month</b></group>
sv: <group>Antal sidor att rendera.Om --style=<b>week</b> och --from=<b>2020-04-27</b> kommer--count=<b>4</b> rendera de fyra sidorna2020-04-27, 2020-05-04, 2020-05-11, och 2020-05-25.Antar värdet 12 för att ge ett helt år då --style=<b>month</b></group>

source: <group>Directory where html files should end up. Default to <b>./html</b></group>
sv: <group>Katalog där html-filer ska placeras. Har standardvärder <b>./html</b></group>

source: <group>How the body of the HTML page should be layed out. <br/><b>week</b> gives a horizontally scrolling page with 7 elements, where each has events graphically laid out hour by hour. <br/><b>table</b> gives a month in overview as a table. Each block contains the events for the given day, in order of start time. They are however not graphically sized. <br/><b>wide</b> is the same as week, but gives a full month.</group>
sv: <group>Hur HTML-sidans komponenter ska placeras.<br/><b>week</b> ger en horisentellt skrollande sida med 7 element, där varje element har händelser grafiskt utlaggda.<br/><b>table</b> ger en månadsöversikt som en tabell, där varje cell visar den dagens händelser i ordning, dock inte grafiskt skalade.<br/><b>wide</b> Motsvarande som week, men för en hel månad</group>

source: <group>Creates a standalone document instead of an HTML fragment for embedding in a larger page. Currently only applies to the <i>small</i> style</group>
sv: <group>Skapar ett fristående dokument istället för ett HTML-fragment för inbäddning i andra sidor. Fungerar för nuvarande bara med stilen <i>small</i></group>

source: <group>Bind to TCP port, defaults to <i>8080</i>. <br/>Can also be set through the config variable <i>port</i>.</group>
sv: <group>Bind till en TCP-port, och blir <i>8080</i> om osatt.<br/>Kan även sättas genom konfigurationsfältet <i>port</i>.</group>

source: <group>Address to use, defaults to <i>0.0.0.0</i> for IPv4, and <i>[::]</i> for IPv6</group>
sv: <group>Address att använda, utgår från <i>0.0.0.0</i> för IPv4, samt <i>[::]</i> för IPv6</group>

source: <group>Run the program within Guile's built in statical profiler. Display style is one of <b>flat</b> or <b>tree</b>.</group>
sv: <group>Kör programmet i Guiles inbyggda statiska profilerare. Visningsstil är <b>flat</b> eller <b>tree</b>.</group>

source: <group>Start a Guile repl which can be connected to, defaults to the unix socket <i>/run/user/${UID}/calp-${PID}</i>, but it can be bound to any unix or TCP socket. ((@ (vcomponent util instance) global-event-object)) should contain all events. <br/> <b>Should NOT be used in production.</b></group>
sv: <group>Startar en Guile-REPL för anslutningar. Binder som standard till unix-sockeln <i>/run/user/${UID}/calp-${PID}</i>, man kan bindas till valfri unix eller TCP sockel. ((@ (vcomponent util instance) global-event-object)) bör inehålla alla händelser<br/><b>Ska INTE användas i produktion.</b></group>

source: <group>Set configuration options, on the form <i>key</i>=<i>value</i> as if they were set in the config file. These options have priority over those from the file. Can <i>not</i> be given with an equal after --option. <br/>Can be given multiple times.</group>
sv: <group>Sätter konfigurationsvariabler, på formen <i>nyckel</i>=<i>värde</i>, motsvarande om de hade satts i konfigurationsfilen. Dock har de här prioritet över dem från filen. Kan <i>inte</i> ges med ett lika-med-tecken efter --option.<br/>Kan ges flera gånger.</group>

source: <group>Print known configuration variables. <br/><b>NOTE</b>: Only those configuration variables which are loaded will be shown, more might be available</group>
sv: <group>Visar kända konfigurationsvariabler.<br/><b>NOTERA</b>: Endast de konfigurationsvariablerna vilka har laddats in kommer visas, fler kan vara finnas</group>

source: [UNTESTED]<br/><p><b>import</b>s a calendar object into the database.</p>
sv: [OTESTAD]<br/><p><b>import</b>erar ett kallenderobjekt till databasen.</p>

source: <p><b>text</b> formats and justifies what it's given on standard input, and writes it to standard output. Similar to this text.</p>
sv: <p><b>text</b> formatterar och justerar det den får på standard-input, och skriver det till standard-output, på motsvarande stil som den här texten.</p>

source: <p><b>benchmark</b> <i>module</i><br/>Runs the procedure 'run-benchmark' from the module (calp benchmark <i>module</i>).</p>
sv: <p><b>benchmark</b> <i>modul</i><br/>Kör proceduren 'run-benchmark' från modulen (calp benchmark <i>modul</i>).</p>

source: Repeated
sv: Upprepas

source: , except on
sv: , undantaget
